Revit 2027 API
AnalysisDisplayMarkersAndTextSettings.TextLabelType Property
 Type of diagram text label visualization.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public AnalysisDisplayStyleMarkerTextLabelType TextLabelType { get; set; }
Public Property TextLabelType As AnalysisDisplayStyleMarkerTextLabelType
	Get
	Set
public:
property AnalysisDisplayStyleMarkerTextLabelType TextLabelType {
	AnalysisDisplayStyleMarkerTextLabelType get ();
	void set (AnalysisDisplayStyleMarkerTextLabelType value);
}
member TextLabelType : AnalysisDisplayStyleMarkerTextLabelType with get, set
Property Value
AnalysisDisplayStyleMarkerTextLabelType
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
AnalysisDisplayMarkersAndTextSettings Class
Autodesk.Revit.DB.Analysis Namespace